wrk_log.txt
wrk -t10 -c500 -d10s --latency http://localhost:3000

1. join 64个连接版本
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.10ms    1.09ms  20.06ms   71.06%
    Req/Sec     9.50k   694.25    18.05k    86.87%
  Latency Distribution
     50%    5.09ms
     75%    5.82ms
     90%    6.39ms
     99%    7.51ms
  950256 requests in 10.10s, 47.12MB read
  Socket errors: connect 0, read 950197, write 0, timeout 0
Requests/sec:  94079.52
Transfer/sec:      4.67MB

2. join 两个连接版本
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.70ms  454.08us  12.55ms   79.64%
    Req/Sec     7.34k   308.00     9.47k    86.20%
  Latency Distribution
     50%    6.70ms
     75%    6.93ms
     90%    7.16ms
     99%    7.89ms
  730590 requests in 10.02s, 36.23MB read
  Socket errors: connect 0, read 730579, write 0, timeout 0
Requests/sec:  72927.92
Transfer/sec:      3.62MB

3. 单纯 tokio::spawn 版本
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.34ms  775.99us  18.31ms   94.45%
    Req/Sec     6.74k   653.22    18.42k    94.91%
  Latency Distribution
     50%    7.36ms
     75%    7.58ms
     90%    7.80ms
     99%    9.01ms
  671547 requests in 10.10s, 33.30MB read
  Socket errors: connect 0, read 671513, write 0, timeout 0
Requests/sec:  66488.35
Transfer/sec:      3.30MB

4. 在1基础上改进handle_connection后
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.76ms    0.97ms  12.52ms   68.21%
    Req/Sec    10.15k   797.19    20.68k    85.56%
  Latency Distribution
     50%    4.76ms
     75%    5.44ms
     90%    5.95ms
     99%    6.95ms
  1013908 requests in 10.10s, 50.28MB read
  Socket errors: connect 0, read 1013845, write 0, timeout 0
Requests/sec: 100388.95
Transfer/sec:      4.98MB

5. version: "async 1.2.1 0.1M QPS", cargo run --release
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.41ms    1.21ms  13.34ms   73.28%
    Req/Sec    12.92k   686.37    17.06k    78.60%
  Latency Distribution
     50%    2.26ms
     75%    3.05ms
     90%    3.93ms
     99%    6.08ms
  1286064 requests in 10.02s, 63.78MB read
  Socket errors: connect 0, read 1285988, write 0, timeout 0
Requests/sec: 128327.52
Transfer/sec:      6.36MB

Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.70ms    1.71ms  25.54ms   75.55%
    Req/Sec    11.98k     2.01k   17.81k    76.10%
  Latency Distribution
     50%    2.32ms
     75%    3.33ms
     90%    4.98ms
     99%    8.43ms
  1192763 requests in 10.02s, 59.15MB read
  Socket errors: connect 0, read 1192674, write 0, timeout 0
Requests/sec: 118997.57
Transfer/sec:      5.90MB

Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.09ms  13.40ms   71.93%
    Req/Sec    13.36k   670.49    17.36k    74.30%
  Latency Distribution
     50%    2.07ms
     75%    2.77ms
     90%    3.54ms
     99%    5.42ms
  1329727 requests in 10.02s, 65.94MB read
  Socket errors: connect 0, read 1329658, write 0, timeout 0
Requests/sec: 132766.09
Transfer/sec:      6.58MB

6. version: "async 1.4.0 0.7M QPS", cargo run --release
Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   698.84us  530.89us   8.64ms   85.17%
    Req/Sec    72.61k     8.01k  120.91k    68.30%
  Latency Distribution
     50%  523.00us
     75%  821.00us
     90%    1.38ms
     99%    2.78ms
  7230962 requests in 10.04s, 524.09MB read
Requests/sec: 720312.27
Transfer/sec:     52.21MB

Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   681.79us  546.89us  16.30ms   86.69%
    Req/Sec    74.65k     7.96k  104.12k    67.40%
  Latency Distribution
     50%  510.00us
     75%  793.00us
     90%    1.34ms
     99%    2.70ms
  7433797 requests in 10.04s, 538.80MB read
Requests/sec: 740355.35
Transfer/sec:     53.66MB

Running 10s test @ http://localhost:3000
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   674.31us  519.68us  15.24ms   85.52%
    Req/Sec    74.95k     8.17k   98.53k    68.20%
  Latency Distribution
     50%  506.00us
     75%  789.00us
     90%    1.33ms
     99%    2.63ms
  7461681 requests in 10.04s, 540.82MB read
Requests/sec: 743558.21
Transfer/sec:     53.89MB